<?php

namespace Database\Seeders;

use App\Models\Article;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ArticleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $article = new Article();
        $article->title = 'สัญญาณเตือน รถต้องถ่ายน้ำมันเครื่องแล้ว';
        $article->description = 'มีเสียงดังผิดปกติจากเครื่องยนต์ รถเร่งเครื่องไม่ขึ้น 
            สีน้ำมันเครื่องเปลี่ยนไป รถกินน้ำมันมากขึ้น มีควันดำออกจากท่อไอเสียรถ';
        $article->image = 'a1.jpg';
        $article->save();

        $article = new Article();
        $article->title = 'น้ำเข้าเครื่องยนต์ ทำอย่างไร แก้ไขตรงจุด';
        $article->description = 'น้ำเข้าเครื่องยนต์ เกิดได้จาก 2 สาเหตุเกิดจาก การรั่วภายใน 
            และ น้ำจากภายนอกเข้าไปในตัวเครื่อง ซึ่งสาเหตุแรกมักเกิดจากเครื่องยนต์ร้อนจัด 
            ทำให้ประเก็นฝาสูบแตกหรือขาด จนน้ำสามารถไหลเข้าไปปนกับน้ำมันเครื่องยนต์ 
            หรือเครื่องยนต์ร้อนจนฝาสูบเครื่องยนต์โก่ง เกิดช่องว่างให้น้ำไหลเข้าไปได้ 
            วิธีสังเกตอาการ หมั่นเช็กปริมาณน้ำในหม้อน้ำ หากลดลงกว่าเกณฑ์ที่กำหนด 
            ควรเติมบ่อยๆ และหาจุดรั่วภายนอก เช็กแผ่นวัดน้ำมันเครื่องออกมาดู 
            ถ้าน้ำมันเครื่องเป็นสีขุ่นๆ พร้อมกับเครื่องยนต์มีอาการเดินเบา 
            สันนิษฐานได้เลยว่ามีน้ำเข้าเครื่องยนต์ 
            ให้รีบน้ำรถเข้าศูนย์หรืออู่ซ่อมเพื่อทำการถ่ายน้ำมันเครื่องทันที';
        $article->image = 'a2.jpg';
        $article->save();

        $article = new Article();
        $article->title = 'ฝันเกี่ยวกับรถ บอกลางดีหรือลางร้าย';
        $article->description = 'เรื่องของความฝันในทางวิทยาศาสตร์นั่นเป็นการสะท้อนจิตใต้สำนึก 
        หรือเหตุการณ์ต่างๆที่ผ่านเข้ามาสะท้อนในขณะที่เราหลับอยู่ 
        บางคนก็มักจะบอกว่าความฝันเป็นลางบอกเหตุทั้งดีและร้ายขึ้นอยู่กับความเชื่อของแต่ละบุคคล 
        พี่หมี TQM เชื่อว่าหลายคนต้องเคยมีความฝันเกี่ยวกับรถยนต์กันบ้าง 
        ว่าแต่หากฝันเกี่ยวกับรถยนต์ มีความหมายอย่างไรบ้าง ไปหาคำตอบกันครับ';
        $article->image = 'a3.jpg';
        $article->save();
    }
}
